app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `mobile`, `name`, `updated_at`) VALUES ('2014-03-05 10:43:50', 'cxcxz', 'Ashish', '2014-03-05 10:43:50')